cfe llm/InformationRegisters/AI_ОчередьЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ОчередьЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AI_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вложение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_СтатусОчереди</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторНовойОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеренесенВЯдро</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗнаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборЗнаний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_НаборыЗнаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_МиграцияОчереди/Ext/Module.bsl
// Opt-in адаптер старого метода. Не меняет старый маршрут без настройки сценария.
Функция ПоставитьПоСценарию(Провайдер, ТипAPI, Модель, Агент, Промт, ИмяВложения, Вложение) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 2 Ссылка ИЗ Справочник.AI_Сценарии
		|ГДЕ Активен И НЕ ПометкаУдаления И ИспользоватьДляСтаройОчереди И Агент = &Агент");
	Запрос.УстановитьПараметр("Агент", Агент);
	Сценарии = Запрос.Выполнить().Выгрузить();
	Если Сценарии.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	Если Сценарии.Количество() > 1 Тогда
		ВызватьИсключение "Для агента настроено несколько сценариев старой очереди.";
	КонецЕсли;
	ПроверитьОтсутствиеВложения(ИмяВложения, Вложение);
	Параметры = ПараметрыПереноса(Сценарии[0].Ссылка, Провайдер, ТипAPI, Модель, Агент, Промт);
	Параметры.ЗапуститьНемедленно = Не ТранзакцияАктивна();
	AI_ПубличныйAPI.НачатьВыполнение(Параметры);
	Возврат Истина;
КонецФункции

// Явный серверный перенос одной записи. Старые записи без владельца требуют
// отдельного подтверждения и роли администратора; инициатором станет текущий пользователь.
Функция ПеренестиЗапрос(Идентификатор, Сценарий, ПодтвержденПереносБезВладельца = Ложь) Экспорт
	Если ТранзакцияАктивна() Тогда
		ВызватьИсключение "Перенос старой очереди запускается вне транзакции.";
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		Набор = РегистрыСведений.AI_ОчередьЗапросов.СоздатьНаборЗаписей();
		Набор.Отбор.УникальныйИдентификатор.Установить(Идентификатор);
		Блокировка = Новый БлокировкаДанных;
		Элемент = Блокировка.Добавить("РегистрСведений.AI_ОчередьЗапросов");
		Элемент.УстановитьЗначение("УникальныйИдентификатор", Идентификатор);
		Блокировка.Заблокировать();
		Набор.Прочитать();
		Если Набор.Количество() <> 1 Тогда
			ВызватьИсключение "Запись старой очереди не найдена.";
		КонецЕсли;
		Запись = Набор[0];
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		Если ЗначениеЗаполнено(Запись.ИдентификаторПользователя) Тогда
			Если Запись.ИдентификаторПользователя <> Пользователь Тогда
				ВызватьИсключение "Нельзя переносить запись другого пользователя.";
			КонецЕсли;
		ИначеЕсли Не ПодтвержденПереносБезВладельца Или Не РольДоступна("AI_ПолныеПрава") Тогда
			ВызватьИсключение "Для записи без владельца требуется явное подтверждение администратора.";
		КонецЕсли;
		Если Запись.Статус = Перечисления.AI_СтатусОчереди.ПеренесенВЯдро Тогда
			ИдентификаторОперации = Запись.ИдентификаторНовойОперации;
		Иначе
			Если Запись.Статус <> Перечисления.AI_СтатусОчереди.Новый Или Запись.КоличествоОшибок > 0 Тогда
				ВызватьИсключение "Перенос разрешен только для новых записей без попыток обработки.";
			КонецЕсли;
			ПроверитьОтсутствиеВложения(Запись.ИмяВложения, Запись.Вложение.Получить());
			Если Сценарий.Агент <> Запись.AI_Агент Тогда
				ВызватьИсключение "Агент сценария не совпадает с агентом записи очереди.";
			КонецЕсли;
			Параметры = ПараметрыПереноса(Сценарий, Запись.Провайдер, Запись.ТипAPI, Запись.Модель, Запись.AI_Агент, Запись.Промт);
			Параметры.ИдемпотентныйКлюч = "legacy-" + Строка(Идентификатор);
			Параметры.ТипИсточника = "РегистрСведений.AI_ОчередьЗапросов";
			Параметры.КлючИсточника = Строка(Идентификатор);
			Параметры.ЗапуститьНемедленно = Ложь;
			Запуск = AI_ПубличныйAPI.НачатьВыполнение(Параметры);
			ИдентификаторОперации = Запуск.ИдентификаторОперации;
			Запись.ИдентификаторНовойОперации = ИдентификаторОперации;
			Запись.ИдентификаторПользователя = Пользователь;
			Запись.Статус = Перечисления.AI_СтатусОчереди.ПеренесенВЯдро;
			Набор.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	AI_ДиспетчерОпераций.ОбработатьОчередь();
	Возврат ИдентификаторОперации;
КонецФункции

Функция ПараметрыПереноса(Сценарий, Провайдер, ТипAPI, Модель, Агент, Промт)
	Параметры = AI_ПубличныйAPI.ПараметрыВыполнения();
	Параметры.Сценарий = Сценарий;
	Параметры.Провайдер = Провайдер;
	Параметры.ТипAPI = ТипAPI;
	Параметры.Модель = Модель;
	Параметры.Агент = Агент;
	Параметры.Промт = Промт;
	Возврат Параметры;
КонецФункции

Процедура ПроверитьОтсутствиеВложения(ИмяВложения, Вложение)
	Если ЗначениеЗаполнено(ИмяВложения) Или Вложение <> Неопределено Тогда
		ВызватьИсключение "Перенос вложений старой очереди требует прикладного адаптера. Запрос не перенесен.";
	КонецЕсли;
КонецПроцедуры
